rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:order => :title}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:order => :release_date}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "title" = '2001: A Space Odyssey!!', "updated_at" = '2015-10-05 18:46:26.977913' WHERE "movies"."id" = 17
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" IS NULL
---
  def findbysamedir
    @movie = Movie.find params[:id]
    if @movie.director.to_s.lstrip.empty?